## Initializing the code by importing Libraries
      As always we first need to import all the import or those libraries that we need in this code. Bascially libraries are the premade code with alot of functions and methods to make developer job easy, mean they dont need to keep write each code all the time, they can just import it from library. Like for a sum function, if developer need to find sum of some values then he need to write a whole code for sum fucntion and then move on but by using libraries he/she doesn't need to write code for sum function as they already have it, all he/she need to do is write sum() and that operation perform. In other words Lib are made to make developer job easy.

In this code I imported two libraries **Numpy** and **Pandas**
1. Where Numpy will use to generate array 
      - Array r basically the type of variables that store more than one values inside then, like a matrix.
2. And Pandas will use to access data, manipluate it, perform operations on it like removing, inserting, replacing values etc.

In [3]:
import numpy as np
import pandas as pd

#### Reading Data
      Here I have use pandas by refering to it short name, which is pd, to read the data inside csv file name 'marketing_campaign.csv' and store it inside a variable name data.

In [4]:
data = pd.read_csv('dataset/marketing_campaign.csv')

#### Inspecting readed data
      Here I use .head() function of pandas which will display first 5 rows of dataset. I did this to inspect whether the above read code work well or not.

In [5]:
data.head()

,Unnamed: 0,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,...,7,0,0,0,0,0,0,3,11,1
1,1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,...,5,0,0,0,0,0,0,3,11,0
2,2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,...,4,0,0,0,0,0,0,3,11,0
3,3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,...,6,0,0,0,0,0,0,3,11,0
4,4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,...,5,0,0,0,0,0,0,3,11,0

#### Filtering only required Columns
      Here I filtered-out unnessary columns from the dataset and leave only required one. This let us lower the amount of total dataset and speedup the operation process, as u can see in above dataset there r around 30 columns and perfoming operation on this numbers of dataset will required alot of computation resources, and by filtering only required columns we reduce the amount of dataset, making it easier for lower systems to work with that.

In [8]:
data = data[['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'Recency','NumStorePurchases', 'NumWebVisitsMonth']]
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5

#### Shape
      This line of code will tell us the numbers of rows and columns. This help us to know amount of dataset we working with.

In [10]:
data.shape

(2240, 11)

#### Grouping and finding Average
      Now this line will group all the values of columns NumStorePurchases based on the row value Kidhome and then find the average of them. This is done by pandas where it done by inspecting all the row data of one Kidhome value and then finding the average of NumStorePurchases column of all these rows. Like in our case there only 3 type of values in Kidhome which r 0,1,2, pandas will first inspect all the row with value 0 and calculate the mean (average) of all the NumStorePurchases column value based on kidhome value 0 and then move to next kidhome value which is 1 and then 2.

In [13]:
data.groupby('Kidhome')['NumStorePurchases'].mean()

Kidhome
0    7.217324
1    3.863181
2    3.437500
Name: NumStorePurchases, dtype: float64

#### Replace the values in Teenhomes
      Here I converted numberic values of column 'Teenhome' to string (alphabatic value), this is done for better understanding of wheather teen present or not. This conversion is done in following way:
- 0 : 'has no teen'
- 1 & Greater than 1 : ,'has teen'
      Where 0 mean there is no teen while 1 or greater than 1 mean there r teens 
      After converting them, I store then in a new column inside the dataset and name it 'Teenhome_replaced'

In [ ]:
data['Teenhome_replaced'] = data['Teenhome'].replace([0,1,2],['has no teen','has teen','has teen'])

#### Inspecting changes
      As mention above about .head() method here I used it for same purpose which is to inpect the changes

In [15]:
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth,Teenhome_replaced
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7,has no teen
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5,has teen
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4,has no teen
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6,has no teen
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5,has no teen

#### Finding and Droping Missing Values
      Now I will find and drop the missing values from the dataset. I will use pandas library method .isnull() to find number of missing values and then use .dropna() method to drop them.

      The Result of this code indicate that only the income column have missing values and it 24 in quantity.

In [16]:
data.isnull().sum()

ID                    0
Year_Birth            0
Education             0
Marital_Status        0
Income               24
Kidhome               0
Teenhome              0
Dt_Customer           0
Recency               0
NumStorePurchases     0
NumWebVisitsMonth     0
Teenhome_replaced     0
dtype: int64

#### Dropping Missing Values
      This line of code will drop all the missing values from dataset and store it inside another variable name 'data_withoutNa' mean data with no null value. I did this to remove the null values without altering the orignal dataset.
      I use .dropna() method of pandas to drop the missing values and tell pandas to drop any missing value by this line (how = 'any').

In [17]:
data_withoutNa = data.dropna(how = 'any')

#### Inspecting Changes
      After dropping missing I again run the same code as I did to check the missing values in orignal dataset but this time I did this with new variable that store the orignal dataset with null values. I did this to check wheather the drop command work as expected or not.
      The result of this code show that the command worked and there is no missing value now in copied dataset.

In [18]:
data_withoutNa.isnull().sum()

ID                   0
Year_Birth           0
Education            0
Marital_Status       0
Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
Recency              0
NumStorePurchases    0
NumWebVisitsMonth    0
Teenhome_replaced    0
dtype: int64

#### Appending two Different Datasets
      Now I will demonstrate appending (merging) of two dataset into one. For this purpose I will python library pandas and it function .concat() to merge them.
      First I imported two new datasets.

In [19]:
sampleDataOne = pd.read_csv('dataset/marketing_campaign_append1.csv')
sampleDataTwo = pd.read_csv('dataset/marketing_campaign_append2.csv')

#### Inspect Data
      This line of code will tell us how many rows and columns are there in where first value show numbers of row while second one show numbers of columns

In [20]:
sampleDataOne.shape

(500, 29)

In [27]:
sampleDataTwo.shape

(500, 29)

#### Appending Data
      As I have already imported both datasets and store them in there respected variables, now I will append them and store them inside another variable name 'appendedData'. I will use pandas method concat by refereing to it short name 'pd' and give both sample data variables as argument ( values).

In [23]:
appendedData = pd.concat( [sampleDataOne, sampleDataTwo])

#### Inspecting Changes
      This line of code demonstrate the changes being made and display number of rows and columns.
      As u see above that number of rows in each sample datasets r 500 and after appending them it become 1000, this show that the above command was successful.

In [24]:
appendedData.shape

(1000, 29)